nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso54s018m/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLCD
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */
void BOARD_InitLCD(void)
{
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);

    IOCON->PIO[2][11] = ((IOCON->PIO[2][11] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT211 (pin K3) is configured as LCD_PWR. */
                         | IOCON_PIO_FUNC(PIO211_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO211_DIGIMODE_DIGITAL));

    IOCON->PIO[2][13] = ((IOCON->PIO[2][13] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT213 (pin P7) is configured as LCD_DCLK. */
                         | IOCON_PIO_FUNC(PIO213_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO213_DIGIMODE_DIGITAL));

    IOCON->PIO[2][14] = ((IOCON->PIO[2][14] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT214 (pin L7) is configured as LCD_FP. */
                         | IOCON_PIO_FUNC(PIO214_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO214_DIGIMODE_DIGITAL));

    IOCON->PIO[2][15] = ((IOCON->PIO[2][15] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT215 (pin M8) is configured as LCD_AC. */
                         | IOCON_PIO_FUNC(PIO215_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO215_DIGIMODE_DIGITAL));

    IOCON->PIO[2][16] = ((IOCON->PIO[2][16] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT216 (pin L8) is configured as LCD_LP. */
                         | IOCON_PIO_FUNC(PIO216_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO216_DIGIMODE_DIGITAL));

    IOCON->PIO[2][21] = ((IOCON->PIO[2][21] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT221 (pin L10) is configured as LCD_VD(3). */
                         | IOCON_PIO_FUNC(PIO221_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO221_DIGIMODE_DIGITAL));

    IOCON->PIO[2][22] = ((IOCON->PIO[2][22] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT222 (pin K10) is configured as LCD_VD(4). */
                         | IOCON_PIO_FUNC(PIO222_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO222_DIGIMODE_DIGITAL));

    IOCON->PIO[2][23] = ((IOCON->PIO[2][23] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT223 (pin M14) is configured as LCD_VD(5). */
                         | IOCON_PIO_FUNC(PIO223_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO223_DIGIMODE_DIGITAL));

    IOCON->PIO[2][24] = ((IOCON->PIO[2][24] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT224 (pin K14) is configured as LCD_VD(6). */
                         | IOCON_PIO_FUNC(PIO224_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO224_DIGIMODE_DIGITAL));

    IOCON->PIO[2][25] = ((IOCON->PIO[2][25] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT225 (pin J11) is configured as LCD_VD(7). */
                         | IOCON_PIO_FUNC(PIO225_FUNC_ALT1)

                         /* Select Analog/Digital mode.
                          * : Digital mode. */
                         | IOCON_PIO_DIGIMODE(PIO225_DIGIMODE_DIGITAL));

